# DBeam_SetBShutAngle

```pascal
PROCEDURE DBeam_SetBShutAngle(angle : REAL);
```

```python
def vs.DBeam_SetBShutAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Examples
```pascal
DBeam_SetBShutAngle(1.0);
```
```python
import vs

angle = 45.0

vs.DBeam_SetBShutAngle(angle)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight